[
    {
      "name": "John Doe",
      "toyName": "Action Figure",
      "subcategory": "dolls",
      "price": 9.99,
      "availableQuantity": 5,
      "rating": 4.5,
      "des":"Dive into the world of action and adventure with this highly detailed action figure. John Doe is ready for thrilling missions and imaginative play. With movable joints and a captivating design, this action figure will bring hours of excitement to any young superhero fan.",
      "image": "https://img.freepik.com/free-vector/flat-design-samurai-background_52683-70562.jpg?size=626&ext=jpg"
    },
    {
      "name": "Jane Smith",
      "toyName": "Building Blocks",
      "subcategory": "dolls",
      "price": 12.99,
      "availableQuantity": 8,
      "rating": 4.2,
      "des":"Unleash your creativity with these versatile building blocks. Jane Smith offers a set that encourages imagination and problem-solving skills. With colorful pieces and endless possibilities, children can construct their own unique creations and explore the wonders of engineering.",
      "image": "https://img.freepik.com/free-vector/letters-3d-white-cubes-colorful-business-pointers-abstract-background_1284-39405.jpg?size=626&ext=jpg"
    },
    {
      "name": "Alex Johnson",
      "toyName": "Dollhouse",
      "subcategory": "dolls",
      "price": 24.99,
      "availableQuantity": 3,
      "rating": 4.8,
      "des":"Step into a miniature world of imagination with this enchanting dollhouse. Alex Johnson offers a beautifully designed dollhouse that comes complete with furniture and accessories. Watch as little ones create stories and embark on imaginative adventures with their favorite dolls",
      "image": "https://img.freepik.com/premium-vector/doll-house-cartoon-illustration_96037-196.jpg?size=626&ext=jpg"
    },
    {
      "name": "Emily Davis",
      "toyName": "Piccu Doll",
      "subcategory": "dolls",
      "price": 19.99,
      "availableQuantity": 6,
      "rating": 4.6,
      "des":"Delight in the charm of the Piccu Doll. Emily Davis presents a lovable companion that is perfect for cuddling and imaginative play. With its soft fabric and adorable features, this doll will capture the hearts of children and become their constant playtime companion.",
      "image": "https://img.freepik.com/free-vector/cute-girl-pink-bow-blue-dress_1450-106.jpg?size=626&ext=jpg"
    },
    {
      "name": "Michael Wilson",
      "toyName": "Remote Control Car",
      "subcategory": "cars",
      "price": 29.99,
      "availableQuantity": 10,
      "rating": 4.9,
      "des":"Get ready for high-speed fun with this sleek remote control car. Michael Wilson presents a powerful and agile racing car that can conquer any terrain. With its responsive controls and impressive speed, children and adults alike can experience the thrill of racing right at their fingertips.",
      "image": "https://img.freepik.com/premium-vector/isometric-flying-taxi-futuristic-concept-car-isolated_272153-42.jpg?size=626&ext=jpg"
    },
    {
      "name": "Sarah Thompson",
      "toyName": "Happy Demon",
      "subcategory": "doll",
      "price": 14.99,
      "availableQuantity": 4,
      "rating": 4.4,
      "des":"Add a touch of mischief to your toy collection with the Happy Demon. Sarah Thompson introduces a cute and mischievous doll that will bring a smile to your face. With its quirky expression and vibrant colors, this doll is perfect for imaginative play and storytelling.",
      "image": "https://img.freepik.com/premium-vector/flat-cute-animal-little-devil-bunny-halloween-illustration-kids-cute-halloween-character_69135-1388.jpg?size=626&ext=jpg"
    },
    {
      "name": "David Miller",
      "toyName": "Destroyer Robot",
      "subcategory": "electronic",
      "price": 8.99,
      "availableQuantity": 12,
      "rating": 4.7,
      "des":"Unleash the power of technology with this incredible Destroyer Robot. David Miller offers a robot packed with features like lights, sound effects, and interactive movements. Watch as it takes on epic battles and sparks the imagination of young robot enthusiasts.",
      "image": "https://img.freepik.com/free-photo/robot-boy-walk-down-street_1340-27697.jpg?size=626&ext=jpg"
    },
    {
      "name": "Olivia Brown",
      "toyName": "Musical Keyboard",
      "subcategory": "electronic",
      "price": 39.99,
      "availableQuantity": 2,
      "rating": 4.3,
      "des":"Let the melody flow with this enchanting musical keyboard. Olivia Brown presents a keyboard that introduces children to the world of music. With various instrument sounds and rhythm options, aspiring musicians can explore their musical talents and create beautiful melodies.",
      "image": "https://img.freepik.com/free-vector/music-design-yellow-illustration_24877-49373.jpg?size=626&ext=jpg"
    },
    {
      "name": "Daniel Davis",
      "toyName": " Driving Monkey",
      "subcategory": "cars",
      "price": 49.99,
      "availableQuantity": 7,
      "rating": 4.1,
      "des":"Join the adventures of the Driving Monkey. Daniel Davis presents an adorable monkey toy that comes with its own mini car. Children can place the monkey inside the car and go on exciting pretend driving adventures, stimulating their imagination and motor skills.",
      "image": "https://img.freepik.com/free-photo/fun-gorilla-3d-illustration_183364-80089.jpg?size=626&ext=jpg"
    },
    {
      "name": "Sophia Wilson",
      "toyName": "Science Experiment Kit",
      "subcategory": "electronic",
      "price": 29.99,
      "availableQuantity": 3,
      "rating": 4.7,
      "des":"Ignite curiosity and love for science with this captivating experiment kit. Sophia Wilson offers a kit filled with hands-on experiments and educational activities. Children can explore scientific concepts while having fun, making this kit the perfect blend of entertainment and learning.",
      "image": "https://img.freepik.com/free-vector/children-fixing-robot-together_1308-77979.jpg?size=626&ext=jpg"
    },
    {
      "name": "Liam Johnson",
      "toyName": "UUZ",
      "subcategory": "cars",
      "price": 29.99,
      "availableQuantity": 7,
      "rating": 4.5,
      "des": "The UUZ is a high-performance radio control car that provides hours of fun and excitement. With its sleek design and powerful motor, this car can race at incredible speeds and perform impressive stunts. It features responsive controls and a durable construction, making it perfect for both indoor and outdoor use. Get ready to experience the thrill of racing with the UUZ!",
      "image": "https://img.freepik.com/premium-photo/boy-is-holding-joystick-plays-with-radio-control-car_244784-199.jpg?size=626&ext=jpg"
    },
    {
      "name": "Emma Thompson",
      "toyName": "Fighting Robot",
      "subcategory": "electronic",
      "price": 39.99,
      "availableQuantity": 4,
      "rating": 4.2,
      "des": "The Fighting Robot is an action-packed electronic toy that brings the excitement of battles to life. This robot is equipped with a powerful gun and can move in various directions, allowing it to engage in thrilling combat scenarios. It features realistic sound effects and flashing lights, enhancing the immersive experience. With its advanced technology and sturdy build, the Fighting Robot is ready to conquer any opponent!",
      "image": "https://img.freepik.com/premium-photo/robot-with-gun-is-standing-small-robot_782419-10062.jpg?size=626&ext=jpg"
    },
    {
      "name": "Noah Miller",
      "toyName": "3d Robot",
      "subcategory": "electronic",
      "price": 19.99,
      "availableQuantity": 6,
      "rating": 4.8,
      "des": "The 3D Robot is a futuristic electronic toy that combines creativity and technology. This interactive robot can perform a wide range of actions and is equipped with a smart phone that allows it to communicate and interact with its surroundings. It features a sleek design and vibrant colors, making it visually appealing. The 3D Robot is a perfect companion for imaginative play and learning.",
      "image": "https://img.freepik.com/free-photo/robot-character-with-smart-phone_1048-3573.jpg?size=626&ext=jpg"
    },
    {
      "name": "Olivia Davis",
      "toyName": "Copter",
      "subcategory": "cars",
      "price": 34.99,
      "availableQuantity": 9,
      "rating": 4.6,
      "des": "The Copter is a remote control helicopter that brings the thrill of flying to your fingertips. With its precision controls and stable flight performance, this copter is perfect for both beginners and experienced pilots. It features a durable construction and can withstand crashes and impacts. Whether you want to fly indoors or outdoors, the Copter will provide endless hours of aerial adventure.",
      "image": "https://img.freepik.com/premium-vector/aeroplane-white-background_33070-1515.jpg?size=626&ext=jpg"
    },
    {
      "name": "Sophia Wilson",
      "toyName": "Dolls Collections",
      "subcategory": "dolls",
      "price": 26.99,
      "availableQuantity": 12,
      "rating": 4.9,
      "des": "The Dolls Collections set is a delightful assortment of charming dolls that will spark the imagination of any child. This collection features a variety of dolls with different outfits and accessories, allowing kids to create their own unique stories and adventures. Each doll is beautifully crafted with attention to detail, making them perfect for both playtime and display. The Dolls Collections set is a wonderful addition to any doll lover's collection.",
      "image": "https://img.freepik.com/free-vector/hand-drawn-christmas-toy-collection_23-2148747734.jpg?size=626&ext=jpg"
    },
    {
      "name": "Mason Brown",
      "toyName": "Construction Vehicle Set",
      "subcategory": "electronic",
      "price": 21.99,
      "availableQuantity": 8,
      "rating": 4.4,
      "des": "The Construction Vehicle Set is a fantastic electronic toy that allows kids to build and operate their own construction site. This set includes various vehicles such as excavators, bulldozers, and cranes, providing endless opportunities for imaginative play. Each vehicle features realistic lights, sounds, and movable parts, enhancing the play experience. The Construction Vehicle Set is perfect for budding engineers and builders!",
      "image": "https://img.freepik.com/free-vector/collection-toys-white-background_1308-2403.jpg?size=626&ext=jpg"
    },
    {
      "name": "Ava Smith",
      "toyName": "Princess Dress-up Set",
      "subcategory": "dolls",
      "price": 16.99,
      "availableQuantity": 5,
      "rating": 4.7,
      "des": "The Princess Dress-up Set is every little girl's dream come true. This set includes a variety of beautiful princess dresses and accessories that will transform any child into a princess. Whether it's for a tea party, a birthday celebration, or simply imaginative play, this dress-up set provides endless possibilities for magical adventures. Let your child's imagination soar with the Princess Dress-up Set!",
      "image": "https://img.freepik.com/free-vector/princesses-constructor-set_1284-24791.jpg?size=626&ext=jpg"
    },
    {
      "name": "William Johnson",
      "toyName": "Racing Car Track",
      "subcategory": "cars",
      "price": 49.99,
      "availableQuantity": 3,
      "rating": 4.3,
      "des": "The Racing Car Track is the ultimate toy for racing enthusiasts. This set includes a dynamic track layout and two high-speed racing cars. The track features loops, curves, and straightaways, allowing for thrilling races and exciting competitions. The cars are designed for maximum speed and performance, ensuring intense racing action. With the Racing Car Track, every race becomes an adrenaline-pumping adventure!",
      "image": "https://img.freepik.com/free-vector/sport-cars-drifting-top-view-illustration_1284-9781.jpg?size=626&ext=jpg"
    },
    {
      "name": "Isabella Davis",
      "toyName": "Electrical Guitar",
      "subcategory": "electronic",
      "price": 32.99,
      "availableQuantity": 6,
      "rating": 4.1,
      "des": "The Electrical Guitar is the perfect instrument for young rockstars. This electronic guitar features a sleek design and produces realistic sound effects, allowing kids to unleash their inner musician. It comes with various preset tunes and adjustable volume control, providing a customizable playing experience. Whether your child is a beginner or a budding guitarist, the Electrical Guitar will inspire creativity and musical exploration.",
      "image": "https://img.freepik.com/free-photo/white-young-boy-with-electric-guitar-shows-heavy-metal-gesture_186202-4349.jpg?size=626&ext=jpg"
    },
    {
      "name": "James Wilson",
      "toyName": "Painting Robot",
      "subcategory": "electronic",
      "price": 37.99,
      "availableQuantity": 2,
      "rating": 4.7,
      "des": "The Painting Robot is an innovative electronic toy that brings art to life. This robot is equipped with a paintbrush and can create beautiful artwork with its precise movements. It features a variety of painting modes and customizable designs, allowing kids to unleash their creativity. The Painting Robot is a fantastic tool for aspiring young artists and a unique addition to any art collection.",
      "image": "https://img.freepik.com/free-vector/artist-robot_1268-53.jpg?size=626&ext=jpg"
    }
  ]
  